var/log/test1.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><CalculateSalesTransaction xmlns="http://bloyal.com/V3.0"><credential xmlns:a="http://schema.bloyal.com/3.0" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:ApplicationId>982938b6-e700-4f53-8363-ad9e03d44026</a:ApplicationId><a:DeviceKey>PVXSVXCYBG-PYHAPVMEIA-PXLRJSODSD</a:DeviceKey><a:Domain>FascTest</a:Domain><a:ExternalUser i:nil="true"/><a:Password>magento1234!</a:Password><a:UsageId i:nil="true"/><a:UserName>Magento</a:UserName></credential><transaction xmlns:a="http://schema.bloyal.com/3.0" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:AppliedDiscounts i:nil="true" xmlns:b="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><a:CalcToken i:nil="true"/><a:CalculatedAccruals i:nil="true"/><a:CalculatedLoyaltyDollars i:nil="true"/><a:CalculatedLoyaltyPoints i:nil="true"/><a:Channel>WebStore</a:Channel><a:Comment i:nil="true"/><a:CouponCodes i:nil="true" xmlns:b="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><a:Created i:nil="true"/><a:Customer><a:Address1>1234 Test Ave.</a:Address1><a:Address2 i:nil="true"/><a:BirthDate i:nil="true"/><a:City>Redmond</a:City><a:CompanyName i:nil="true"/><a:Country i:nil="true"/><a:EmailAddress>testcustomer@bloyal.com</a:EmailAddress><a:FaxNumber i:nil="true"/><a:FirstName>Test</a:FirstName><a:FirstName2 i:nil="true"/><a:Id i:nil="true"/><a:LastName>User</a:LastName><a:LastName2 i:nil="true"/><a:MobilePhone i:nil="true"/><a:NickName i:nil="true"/><a:Number i:nil="true"/><a:Phone1 i:nil="true"/><a:Phone2 i:nil="true"/><a:State>AK</a:State><a:ZipCode>411111</a:ZipCode><a:AccountNumber i:nil="true"/><a:AccountType i:nil="true"/><a:Comment i:nil="true"/><a:Created i:nil="true"/><a:CustomCode1 i:nil="true"/><a:CustomCode2 i:nil="true"/><a:CustomCode3 i:nil="true"/><a:CustomCode4 i:nil="true"/><a:CustomCode5 i:nil="true"/><a:CustomCode6 i:nil="true"/><a:CustomCode7 i:nil="true"/><a:CustomCode8 i:nil="true"/><a:ExternalId i:nil="true"/><a:FacebookId i:nil="true"/><a:LoyaltyCardNumber i:nil="true"/><a:MobileDeviceId i:nil="true"/><a:ParentAccountNumber i:nil="true"/><a:PriceLevel i:nil="true"/><a:SignupStoreCode i:nil="true"/><a:TaxExempt i:nil="true"/><a:Title i:nil="true"/><a:TwitterId i:nil="true"/><a:Type i:nil="true"/><a:Updated i:nil="true"/><a:WebAddress i:nil="true"/></a:Customer><a:ExcludedDiscountCodes i:nil="true" xmlns:b="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><a:ExternalId i:nil="true"/><a:Flags i:nil="true" xmlns:b="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><a:GuestCheckout>false</a:GuestCheckout><a:Lines><a:TransactionLine><a:Components i:nil="true"/><a:CouponCode i:nil="true"/><a:Description i:nil="true"/><a:Discount i:nil="true"/><a:DiscountCode i:nil="true"/><a:DiscountReasonCode i:nil="true"/><a:InitialPrice i:nil="true"/><a:NetAmount>7.99</a:NetAmount><a:Number i:nil="true"/><a:OrderDiscount i:nil="true"/><a:PriceSource i:nil="true"/><a:Product i:type="a:ProductDetail"><a:Cost i:nil="true"/><a:Created i:nil="true"/><a:Id>0</a:Id><a:LastCost i:nil="true"/><a:LookupCode>WF-8711-SIL</a:LookupCode><a:Name>1 Row Choker Silver</a:Name><a:ParentCode i:nil="true"/><a:Price>7.99</a:Price><a:ProductType i:nil="true"/><a:ReplacementCost i:nil="true"/><a:TaxExempt i:nil="true"/><a:Updated i:nil="true"/><a:Weight i:nil="true"/><a:AdultSignatureRequired i:nil="true"/><a:BasePrice i:nil="true"/><a:CategoryCode i:nil="true"/><a:DepartmentCode i:nil="true"/><a:Description i:nil="true"/><a:EProduct i:nil="true"/><a:MSRP i:nil="true"/><a:MinimumPrice i:nil="true"/><a:PickupOnly i:nil="true"/><a:PriceLevelA i:nil="true"/><a:PriceLevelB i:nil="true"/><a:PriceLevelC i:nil="true"/><a:RestockDate i:nil="true"/><a:SalePrice i:nil="true"/><a:StatusString i:nil="true"/><a:SubDescription1 i:nil="true"/><a:SubDescription2 i:nil="true"/><a:SubDescription3 i:nil="true"/><a:WebDescription i:nil="true"/><a:WebName i:nil="true"/></a:Product><a:Quantity>1.0000</a:Quantity><a:SalesRepCode i:nil="true"/><a:SerialNumbers i:nil="true"/><a:ShipmentNumber i:nil="true"/><a:Tax>0</a:Tax><a:TaxDetails><a:TaxDetail><a:Amount>0</a:Amount><a:Code i:nil="true"/><a:Rate>0</a:Rate></a:TaxDetail></a:TaxDetails><a:TotalAmount>0</a:TotalAmount><a:TotalPrice>0</a:TotalPrice><a:TotalWeight>0</a:TotalWeight></a:TransactionLine></a:Lines><a:Number i:nil="true"/><a:OrderDiscount i:nil="true"/><a:OrderNumber i:nil="true"/><a:Payments><a:TransactionPayment><a:Amount>7.99</a:Amount><a:External>false</a:External><a:Number i:nil="true"/><a:PaymentToken i:nil="true"/><a:TenderCode>CASH</a:TenderCode><a:TransactionCode i:nil="true"/></a:TransactionPayment></a:Payments><a:ReceiptEmail i:nil="true"/><a:Shipments><a:TransactionShipment><a:CarrierCode>UPS</a:CarrierCode><a:Charge>140.0600</a:Charge><a:CouponCode i:nil="true"/><a:Discount i:nil="true"/><a:DiscountCode i:nil="true"/><a:DiscountReasonCode i:nil="true"/><a:ExternalId i:nil="true"/><a:GiftPackage>false</a:GiftPackage><a:LocationCode i:nil="true"/><a:NetAmount>0</a:NetAmount><a:Number i:nil="true"/><a:Recipient><a:Address1>1234 Test Ave</a:Address1><a:Address2 i:nil="true"/><a:BirthDate i:nil="true"/><a:City>Redmond</a:City><a:CompanyName i:nil="true"/><a:Country i:nil="true"/><a:EmailAddress i:nil="true"/><a:FaxNumber i:nil="true"/><a:FirstName>Test1</a:FirstName><a:FirstName2 i:nil="true"/><a:Id i:nil="true"/><a:LastName>User</a:LastName><a:LastName2 i:nil="true"/><a:MobilePhone i:nil="true"/><a:NickName i:nil="true"/><a:Number i:nil="true"/><a:Phone1 i:nil="true"/><a:Phone2 i:nil="true"/><a:State>AK</a:State><a:ZipCode>411111</a:ZipCode></a:Recipient><a:ServiceCode>GND</a:ServiceCode><a:ShipDate i:nil="true"/><a:Tax>0</a:Tax><a:TaxDetails><a:TaxDetail><a:Amount>0</a:Amount><a:Code i:nil="true"/><a:Rate>0</a:Rate></a:TaxDetail></a:TaxDetails><a:TotalAmount>0</a:TotalAmount><a:Type>Ship</a:Type></a:TransactionShipment></a:Shipments><a:SourceExternalId_ReadOnly i:nil="true"/><a:TotalAmount>0</a:TotalAmount><a:TotalOrderDiscounts>0</a:TotalOrderDiscounts><a:TotalPayment>0</a:TotalPayment><a:TotalPrice>0</a:TotalPrice><a:TotalProductDiscount>0</a:TotalProductDiscount><a:TotalQuantity>0</a:TotalQuantity><a:TotalShippingAmount>0</a:TotalShippingAmount><a:TotalShippingCharge>0</a:TotalShippingCharge><a:TotalShippingDiscounts>0</a:TotalShippingDiscounts><a:TotalShippingTax>0</a:TotalShippingTax><a:TotalTax>0</a:TotalTax><a:TotalWeight>0</a:TotalWeight><a:CashierCode i:nil="true"/><a:DeviceCode i:nil="true"/><a:DeviceTitle i:nil="true"/><a:OnSitePurchase i:nil="true"/><a:RegisterNumber i:nil="true"/><a:StoreCode i:nil="true"/><a:StoreTitle i:nil="true"/></transaction><options xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"/></CalculateSalesTransaction></s:Body></s:Envelope>